In [1]:
import pandas as pd

df = pd.read_csv(r"C:\Users\klai\OneDrive - Cherry Creek School District\Desktop\Artificial_Intelligence\titanic.csv")
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [27]:
df.at[5, 'Age']=28.0
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q

In [29]:
maj=df['Age']>18
print(maj)

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [30]:
count=maj.sum()
print(count, "passengers are over 18.")

576 passengers are over 18.

In [32]:
count = 0
for sekai in df['Age']:
    if sekai > 18:
        count = count +1
count

576

In [34]:
count = 0
for sekai in df['Sex']:
    if sekai == "male":
        count = count + 1
    
count = (count / len(df)) * 100
count

64.75869809203144

In [41]:
tone = 0 
for tickone in df['Pclass']:
    if tickone == 1:
        tone = tone + 1
        
ttwo = 0 
for ticktwo in df['Pclass']:
    if ticktwo == 2:
        ttwo = ttwo + 1
        
ttree = 0 
for ticktree in df['Pclass']:
    if ticktree == 3:
        ttree = ttree + 1
        
print("There were", tone, "passengers in first class,", ttwo, "in second class, and", ttree, "in third class.")

There were 216 passengers in first class, 184 in second class, and 491 in third class.